content/posts/20210328162056-discord.md
+++
title = "Discord"
author = ["Daniel Biasiotto"]
draft = false
+++

## Fonti {#fonti}

-   [Discord Bot for Trading](https://scarzer.medium.com/make-a-discord-bot-for-you-and-your-friends-to-trade-stocks-bde681ad38e2)


## Bot {#bot}

`Discord.py` is a well supported wrapper for the discord API.

-   To add a command use `async def`
-   Adding a prefix to commands helps find issued commands

<!--listend-->

```python
  import discord, io, os
  from discord.ext import command
  DISCORD_TOKEN = os.environ.get("DISCORD_TOKEN")

  ## First command
  @bot.command()
  async def hello_world(context):
      await context.send("Hello!")

  ## Start the bot
  bot.run(DISCOND_TOKEN)
```


### Tools {#tools}

-   [Discord Embed Sandbox](https://cog-creators.github.io/discord-embed-sandbox/)
-   [Alpaca]({{< relref "20210328171522-alpaca.md" >}})